Revit 2027 API
LightGroupManager.DeleteGroup Method
 Remove the given LightGroup object from the set of LightGroup objects
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteGroup(
	ElementId groupId
)
Public Sub DeleteGroup (
	groupId As ElementId
)
public:
void DeleteGroup(
	ElementId^ groupId
)
member DeleteGroup :
        groupId : ElementId -> unit
Parameters
groupId ElementId
 The Id of the LightGroup object to remove
Exceptions
Exception | Condition
ArgumentException |  The given element Id does not correspond to a light group -or- The LightGroup is not contained by this LightGroupManager
ArgumentNullException |  A non-optional argument was null
Remarks
 Note that only the group is deleted, not the lights contained in the group The lights will still exist but will not be in a group any longer
See Also
Reference
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace